tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "iptiq/iptiq-cli", "git@gitlab.com:iptiq/sre/iptiq-cli.git"
tap "oven-sh/bun"
brew "awscli"
brew "bat"
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "node"
brew "gh"
brew "git"
brew "jq"
brew "jupyterlab"
brew "k6"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "kubectx"
brew "maven"
brew "okta-aws-cli"
brew "python@3.12"
brew "redis"
brew "terraform"
brew "wget"
brew "iptiq/iptiq-cli/iptiq-cli"
brew "oven-sh/bun/bun"
cask "alfred"
cask "anaconda"
cask "aws-vault-binary"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "maccy"
cask "obsidian"
cask "postman"
cask "slack"
cask "rectangle"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "warp"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "eridem.vscode-nupkg"
vscode "formulahendry.dotnet-test-explorer"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "ionide.ionide-fsharp"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "kreativ-software.csharpextensions"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "sj0000e.hexdiff"
vscode "srinivasankk.js-web-component"
vscode "stivo.tailwind-fold"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "thekalinga.bootstrap4-vscode"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
